Revit 2024 API
ParameterTypeId.DecalSubcategoryId Property
 "Subcategory"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId DecalSubcategoryId { get; }
Visual Basic
Public Shared ReadOnly Property DecalSubcategoryId As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ DecalSubcategoryId {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace